[LANG]
language=Indonesian
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Kesalahan Sintaks SQL
200002=File tidak ditemukan
200003=File rusak
200004=Kesalahan Parameter
200026=Nama tabel sudah duplikat
200027=Nama tabel tidak ditemukan
200028=Kesalahan mengimpor file CSV, gagal membuat SQL, harap periksa apakah konten file CSV dan item konfigurasi sudah benar
300001=Kolom tabel untuk membuat indeks belum dipilih
300002=Pernyataan SQL tidak boleh kosong
300003=Analisis SQL hanya mendukung pernyataan kueri SELECT
[STRING]
home=Beranda
database=Basis Data
analysis=Analisis
view=Tampilan
setting=Pengaturan
items=Catatan
tables=Tabel
views=Tampilan
triggers=Trigger
columns=Kolom
indexes=Indeks
table=Tabel
clear-all=Hapus Semua
yes=Ya
no=Tidak
welcome-text=Selamat Datang di CuteSqlite
home-text1=CuteSqlite adalah alat klien antarmuka pengguna grafis (GUI) untuk Sqlite3.
home-text2=Ini memungkinkan Anda merancang, membuat, dan menjelajahi basis data, menangani objek basis data,
home-text3=dan menyisipkan data serta merancang dan menjalankan kueri SQL untuk memproses data yang disimpan.
home-text4=Anda juga dapat memigrasikan basis data dan data dari penyedia basis data lain ke basis data Sqlite.
db-section-text=Basis Data Sqlite
analysis-text1=CuteSqlite memungkinkan Anda menganalisis dan mengoptimalkan kinerja pernyataan SQL.
analysis-text2=Dan memungkinkan Anda menganalisis kapasitas penyimpanan setiap tabel dalam basis data,
analysis-text3=serta mengkonfigurasi parameter basis data untuk mengoptimalkan basis data.
perf-analysis-section-text=Analisis Kinerja
error-text=Kesalahan Sistem:
create-database=Buat basis data baru (Ctrl+N)
open-database=Buka basis data (Ctrl+O)
refresh-database=Segarkan basis data (F5)
delete-database=Hapus basis data yang dipilih dari daftar (Del)
override-user-db=Data file tidak dapat dipulihkan setelah dihapus, yakin ingin menimpa basis data?
create-db-success-text=Basis data berhasil dibuat
open-db-exists-inlist=Basis data sudah dibuka, harap jangan operasi berulang
open-db-success-text=Basis data berhasil dibuka
delete-user-db=Yakin ingin menghapus basis data "{dbName}" yang dipilih dari daftar?
delete-db-success-text=Berhasil menghapus basis data dari daftar
query-editor=Editor Kueri
history=Riwayat
history-tip=Riwayat (F8)
result-list=Hasil
result-info=Informasi
result-table-data=Data Tabel
table-properties=Properti Tabel
exec-select-sql=Jalankan kueri yang dipilih saat ini (F9)
exec-all-sql=Jalankan semua kueri (F10)
explain-select-sql=Explain pernyataan SQL yang dipilih saat ini (F11)
explain-query-plan-sql=Explain query plan pernyataan SQL yang dipilih saat ini (F12)
query-page-help=Fitur autocomplete: [Tab]->Tab berikutnya; [Ctrl+Space]->Daftar tab yang cocok; [Ctrl+Enter]->Daftar semua tab
no-select-userdb=Basis data belum dipilih
no-sql-statement=Tidak ada pernyataan SQL yang dimasukkan di editor kueri
no-sql-content=Tidak ada pernyataan SQL di editor kueri
show-form-view=Tampilkan tampilan formulir
export-result-as=Ekspor sebagai... (Ctrl+Alt+E)
copy-result-data=Salin data ke papan klip
clear-all=Hapus Semua
ok=OK
cancel=Batal
export-text-description=Pilih format ekspor data
csv-settings=Opsi csv
csv-field-settings=Kolom
csv-line-settings=Baris
csv-charset-settings=Enkoding
excel-settings=Opsi Excel
sql-settings=Opsi SQL
export-fields-settings=Pilih kolom untuk diekspor
terminated-by=Pemisah
enclosed-by=Pembungkus
escaped-by=Karakter Escape
field-terminated-by=Pemisah Kolom
field-enclosed-by=Pembungkus Kolom
field-escaped-by=Escape Kolom
line-terminated-by=Pemisah Baris
add-column-name=Tambahkan nama kolom di header
csv-charset=Enkoding
excel-column-max-size=Batas ukuran kolom teks
excel-decinmal-places=Desimal
structure-only=Hanya struktur tabel
data-only=Hanya data
structure-and-data=Struktur tabel dan data
select-all=Pilih Semua
deselect-all=Batal Pilih Semua
save-to-file=Ekspor ke file
expert-fmt-error=Harap pilih format file ekspor data
terminated-by-error=Harap masukkan nilai "Diakhiri Dengan"
enclosed-by-error=Harap masukkan nilai "Dibungkus Oleh"
escaped-by-error=Harap masukkan nilai "Karakter Escape"
line-terminated-by-error=Nilai "Diakhiri Dengan" baris tidak benar
excel-column-max-size-error=Harap masukkan nilai "Batas ukuran kolom teks"
excel-decinmal-places-error=Harap masukkan nilai "Desimal"
export-sql-error=Harap pilih opsi SQL
selected-fields-error=Harap pilih kolom untuk diekspor
export-path-error=Harap masukkan jalur file ekspor
sql-notsupport-multitable-query-error=Ekspor hasil kueri multi-tabel dan sub-kueri tidak didukung
export-success-text=Ekspor berhasil, {rows} baris data telah diekspor, apakah ingin membuka file?
open-the-file=Buka file
export-file-exists-prompt={export-path} sudah ada, apakah ingin mengganti?
limit-rows=Batas Baris
offset=Baris Mulai
rows=Jumlah Baris
copy-all-rows-to-clipboard=Salin semua baris ke papan klip	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Salin baris yang dipilih ke papan klip	Ctrl+Alt+H
copy-all-rows-as-sql=Salin semua baris sebagai SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Salin baris yang dipilih sebagai SQL	Ctrl+Alt+K
read-only=Hanya Baca
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filter sedang digunakan
refresh=Segarkan (Ctrl+F5)
refresh-page=Segarkan
new-row-tip=Buat baris baru (Ctrl+Alt+N)
copy-row-tip=Salin satu baris (Ctrl+Alt+C)
save-tip=Simpan (Ctrl+Alt+S)
delete-tip=Hapus baris yang dipilih (Ctrl+Del)
cancel-tip=Batalkan perubahan (Ctrl+Alt+Z)
revert-tip=Pulihkan
save=Simpan
revert=Batalkan perubahan
column=Nama Kolom
condition=Kondisi
value=Nilai
delete-confirm-text=Yakin ingin menghapus baris yang dipilih?
query=Kueri
result=Hasil
affected-rows=Jumlah baris yang terpengaruh
exec-time=Waktu Eksekusi
transfer-time=Waktu Transfer
total-time=Waktu Total
database-create=Buat basis data baru		Ctrl+N
database-open=Buka basis data		Ctrl+O
database-refresh=Segarkan basis data		Ctrl+R
database-delete=Hapus basis data		Del
database-copy=Salin basis data menjadi...	Ctrl+P
database-export-as-sql=Ekspor basis data ke SQL	Ctrl+E
database-import-from-sql=Impor SQL ke basis data	Ctrl+I
database-new=Buat
database-new-table=Tabel
database-new-view=Tampilan
database-new-trigger=Trigger
export-as-sql-text-description=Ekspor tabel/tampilan/trigger basis data yang dipilih sebagai SQL
select-database=Basis data yang dipilih
database-objects=Objek
structure-and-data-settings=Pengaturan struktur dan data
insert-statement-settings=Pengaturan Pernyataan INSERT
tbl-statement-settings=Pengaturan Pernyataan Tabel
retain-column-text=Pertahankan nama kolom di "Insert Into"
contain-multi-rows-text=Setiap pernyataan "Insert" berisi beberapa baris (VALUES)
retain-table-text=Pertahankan tabel lama (Create Table If Not Exists ...)
override-table-text=Timpa tabel lama (DROP TABLE, lalu CREATE TABLE)
import-from-sql-text-description=Jalankan pernyataan dalam file SQL secara batch.
abort-on-error-text=Hentikan saat terjadi kesalahan.
import-file-not-exists=File SQL yang diimpor tidak ditemukan, harap pilih lagi.
import-path-empty-error=Jalur file yang diimpor tidak boleh kosong.
import=Impor
export=Ekspor
tbl-name=Nama Tabel
new-table=Buat Tabel
new-view=Buat Tampilan
new-trigger=Buat Trigger
database=Basis Data
schema=Skema
table-columns=Kolom
table-indexes=Indeks
table-foreignkeys=Kunci Asing
column-name=Nama Kolom
data-type=Tipe Data
default=Default
check=Periksa
index-name=Nama Indeks
index-type=Tipe Indeks
index-unique=Unik
partial-clause=Klausa Parsial
comments=Komentar
to-be-selected=Kolom menunggu dipilih
selected=Kolom yang dipilih
up=▲
down=▼
no-columns-selected=Kolom belum dipilih, harap pilih
sql-preview=Pratinjau SQL
tbl-name-empty=Nama tabel tidak boleh kosong
tbl-name-duplicated=Nama tabel sudah duplikat
create-table-success-text=Tabel berhasil dibuat.
alter-table-success-text=Tabel berhasil diubah.
rename-table-success-text=Nama tabel berhasil diubah.
delete-column-confirm-text=Kolom yang dipilih direferensikan oleh satu atau lebih indeks. Menghapus kolom ini juga akan memodifikasi indeks yang sesuai. Yakin ingin melanjutkan penghapusan?
delete-index-confirm-text=Indeks yang dipilih direferensikan oleh satu atau lebih kolom. Menghapus indeks ini juga akan memodifikasi kolom yang sesuai. Yakin ingin melanjutkan penghapusan?
delete-confirm-text=Yakin ingin melanjutkan penghapusan?
new-view=Buat Tampilan
new-trigger=Buat Trigger
create-a-view-name=Nama tampilan baru
view-name-not-empty=Nama tampilan baru tidak boleh kosong
view-name-duplicated=Nama tampilan sudah duplikat
create-a-trigger-name=Nama trigger
trigger-name-not-empty=Nama trigger tidak boleh kosong
trigger-name-duplicated=Nama trigger sudah duplikat
execute-sql-success=Eksekusi SQL berhasil
copy-db-success-text=Salin basis data berhasil
table-open=Buka data tabel		Alt+O
table-create=Buat tabel		Alt+N
table-alter=Ubah tabel		Alt+A
table-rename=Ganti nama tabel		Alt+M
table-truncate=Kosongkan tabel		Alt+T
table-drop=Hapus tabel		Alt+Del
table-copy-as=Salin tabel menjadi...		Alt+P
table-sharding-as=Sharding		Alt+G
table-export=Ekspor tabel menjadi...	Alt+E
table-import-sql=Impor dari file SQL	Alt+I
table-import-csv=Impor dari file CSV	Alt+J
table-manage-index=Kelola indeks tabel
table-manage-foreign-key=Kelola kunci asing tabel
properties=Properti
primary-key-duplicated=Kunci Utama (Primary key) didefinisikan duplikat.
foreignkey-name=Nama Kunci Asing
referencing-columns=Kolom tabel ini
referenced-table=Tabel Referensi
referenced-columns=Kolom Referensi
on-update=On Update
on-delete=On Delete
insert-new-column=Tambah kolom baru
insert-new-index=Tambah indeks baru
insert-new-foreignkey=Tambah kunci asing baru
insert-del-column=Hapus kolom yang dipilih
insert-del-index=Hapus indeks yang dipilih
insert-del-foreignkey=Hapus kunci asing yang dipilih
select-referenced-table-first=Harap pilih tabel referensi terlebih dahulu
new-table-name=Nama tabel baru
table-name-not-empty=Nama tabel baru tidak boleh kosong
table-name-duplicated=Nama tabel baru sudah duplikat
ai-column-exists=Kolom Auto Increment (AUTOINCREMENT) sudah ada.
ai-fobidden-multi-pk=Kolom Auto Increment (AUTOINCREMENT) sudah ada, beberapa kolom kunci utama tidak diizinkan.
ai-column-must-integer=Kolom Auto Increment (AUTOINCREMENT) harus berupa tipe integer INTEGER.
truncate-table-confirm-text=Setelah tabel dikosongkan, data tidak dapat dipulihkan, yakin ingin mengosongkan?
truncate-table-success-text=Berhasil mengosongkan tabel data
drop-table-confirm-text=Setelah tabel data dihapus, data tidak dapat dipulihkan, yakin ingin menghapus?
drop-table-success-text=Berhasil menghapus tabel data
copy-table-text-description=Konfigurasi parameter salinan, mendukung sharding tabel data
from-db-name=Basis data sumber
from-tbl-name=Tabel sumber
to-db-name=Basis data tujuan
to-tbl-name=Tabel tujuan
table-sharding-setttings=Sharding tabel data
enable-table-sharding=Aktifkan sharding tabel data
table-suffix-begin={suffix} Angka Awal
table-suffix-end={suffix} Angka Akhir
advanced-settings=Opsi lanjutan sharding tabel
enable-copy-data-with-strategy=Aktifkan strategi, salin data ke tabel sharding
sharding-strategy-express-text=Ekspresi strategi pembagian tabel: {n}
preview-sql=Pratinjau pernyataan SQL
structure-and-data-settings-unknown=Pengaturan struktur dan data belum dipilih
table-suffix-error=Angka sharding tidak valid, harap isi nilai yang benar
target-table-name-no-n=Tabel tujuan harus berisi string "{n}".
sharding-strategy-express-empty=Ekspresi strategi pembagian tabel tidak boleh kosong
copy-table-success-text=Salin tabel berhasil.
start=Mulai
complete=Selesai
express-title=Ekspresi strategi sharding tabel
functions=Fungsi
express-editor-help=Ekspresi - Klik ganda fungsi atau kolom, sisipkan ke editor
import-from-csv-text-description=Item konfigurasi untuk mengimpor data dari file CSV
source-csv-file=Jalur file CSV sumber
target-database=Basis data tujuan
target-table=Tabel tujuan
columns-setttings=Kolom
csv-data=Data CSV
column-name-on-top=Baris pertama sebagai nama kolom
line-terminated-by=Pemisah Baris
csv-null-as-keyword=null/NULL sebagai kata kunci SQL
encoding=Encoding
import-success-text=Impor berhasil
incorrect-sql-statement=Pernyataan SQL salah
import-error-text=Kesalahan Impor
table-manage-columns=Kelola kolom
table-drop-column=Hapus kolom
table-manage-indexes=Kelola indeks
table-drop-index=Hapus indeks
create-view=Buat tampilan baru
open-view=Buka tampilan
drop-view=Hapus tampilan
create-trigger=Buat trigger
open-trigger=Buka trigger
drop-trigger=Hapus trigger
drop-view-confirm-text=Setelah tampilan dihapus, tampilan tidak dapat dipulihkan, yakin ingin menghapus?
drop-view-success-text=Berhasil menghapus tampilan
drop-trigger-confirm-text=Setelah trigger dihapus, trigger tidak dapat dipulihkan, yakin ingin menghapus?
drop-trigger-success-text=Berhasil menghapus trigger
sql-templates=Templat Pernyataan SQL
pragma-templates=Pragmas
sql-log=Log SQL
clear-all=Hapus Semua
use=Gunakan
explain=Explain
top=Pin
untop=Batal Pin
copy=Salin
delete=Hapus
today=Hari Ini
yestoday=Kemarin
delete-sql-log-confirm-text=Apakah Anda yakin ingin menghapus log SQL?
copy-to-clipboard=Disalin ke papan klip
save-success-text=Simpan berhasil
delete-success-text=Hapus berhasil
data-has-changed=Data telah diubah, apakah Anda yakin ingin menutup halaman?
not-save-and-close=Tutup tanpa menyimpan
cancel=Batal Tutup
table-export-as=Ekspor tabel data	Alt+E
export-as-sql-success-text=Ekspor berhasil, apakah ingin membuka file?
new-query=Buat jendela kueri baru (F7)
save-current=Simpan saat ini (Ctrl+S)
save-all=Simpan Semua (Ctrl+Shift+S)
first-page=Halaman Pertama
prev-page=Halaman Sebelumnya
next-page=Halaman Selanjutnya
last-page=Halaman Terakhir
save-if-data-has-changed=Data telah diubah, yakin ingin menyimpan terlebih dahulu?
unsort=Batal Urut
tab-close-this=Tutup
tab-close-others=Tutup Lainnya
tab-close-left=Tutup Semua di Kiri
tab-close-right=Tutup Semua di Kanan
perf-analysis=Analisis Kinerja
perf-analysis-reports=Laporan Analisis
store-analysis=Analisis Penyimpanan
db-params=Parameter Basis Data
not-select-sql=Hanya mendukung pernyataan SELECT
open-sql-log=Buka log SQL untuk analisis kinerja (Ctrl+L)
add-sql-analysis=Masukkan pernyataan SQL untuk analisis kinerja (Ctrl+I)
sql-log-not-found=Log SQL tidak ditemukan, harap periksa apakah sudah dihapus
original-sql=Pernyataan SQL Asli
where-clause-analysis=Analisis Klausa WHERE
order-clause-analysis=Analisis Klausa ORDER
covering-index-analysis=Analisis Indeks Covering
table-join-analysis=Analisis Joins
in-table=Tabel Data
where-use-column=Pernyataan WHERE menggunakan kolom
order-use-column=Pernyataan ORDER menggunakan kolom
covering-index-column=Pernyataan WHERE dan ORDER menggunakan kolom
where-use-index=Pernyataan WHERE menggunakan indeks
order-use-index=Pernyataan ORDER menggunakan indeks
use-covering-index=Menggunakan indeks covering
create-index-for-performance=Saran: Buat indeks untuk kolom berikut dapat meningkatkan kinerja kueri
hint-index-for-performance=Petunjuk: Indeks{hintIndexName} telah mencakup kolom yang termasuk: {hintIndexColumns}
create-covering-index-for-performance=Saran: Buat indeks covering untuk kolom berikut dapat meningkatkan kinerja kueri
create-index-togeger=Buat Indeks
create-index-individ=Buat Indeks Secara Terpisah
create-covering-index=Buat Indeks Covering
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Kode pseudo di bawah ini menunjukkan proses eksekusi pengoptimal kueri
cycle-count=Statistik Loop
optimize-cycle-count=Petunjuk: Mengubah urutan tabel JOIN yang berbeda dapat mengoptimalkan dan mengurangi jumlah loop.
general-settings=Pengaturan Umum
about=Tentang
language-setting=Pengaturan Bahasa Antarmuka
change-language-restart-text=Mengubah bahasa, harus memulai ulang perangkat lunak ini agar berlaku.
close-and-restart=Tutup dan Mulai Ulang
do-not-restart=Jangan Mulai Ulang
about-us=Tentang Kami
about-us-description=CuteSqlite adalah perangkat lunak open source yang dikembangkan oleh penulis Xuehan Qin.
version-info=Versi
version-info-description=CuteSqlite v0.2.2 beta (64 bit)
feedback=Umpan Balik
feedback-description=Jika Anda memiliki masalah perangkat lunak, atau memiliki ide dan saran untuk aplikasi ini, harap isi formulir di bawah ini untuk memberi umpan balik kepada kami.
content-text=Konten
license=Apache License Version 2.0
select-columns-analysis=Analisis Kolom Select
select-use-column=Pernyataan Select menggunakan kolom berikut
select-use-column-count=Jumlah Kolom
select-use-column-advice=Saran: Kolom yang dipilih dalam pernyataan SELECT melebihi{maxColumns} kolom, coba kurangi kolom untuk meningkatkan kinerja kueri.
select-use-column-tips=Petunjuk: Coba kurangi kolom untuk meningkatkan kinerja kueri.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=Analisis Penyimpanan:
analysis-sql=Analisis SQL
open-perf-report=Buka Laporan		Alt+O
drop-perf-report=Hapus Laporan		Alt+Del
drop-perf-report-confirm-text=Yakin ingin menghapus laporan?
store-analysis-text=Memungkinkan Anda menganalisis kapasitas penyimpanan basis data, tabel data, indeks tabel
table-store-analysis=Tabel - {tblName}
index-store-analysis=Indeks - {idxName} - Tabel Induk:{tblName}
db-disk-used-title=Laporan utilisasi ruang disk, Jalur DB:{dbPath}
page-size-text=Ukuran Halaman (Satuan: Byte)
page-size-tips=Ukuran Halaman (Satuan: Byte)
file-bytes-text=Ukuran File (Satuan: Byte)
file-bytes-tips=Ukuran File (Satuan: Byte)
file-pgcnt-text=Jumlah halaman dalam seluruh file (Nilai Terukur)
file-pgcnt-tips=Jumlah halaman dalam seluruh file (Nilai Terukur)
file-pgcnt2-text=Jumlah halaman dalam seluruh file (Nilai Hitungan)
file-pgcnt2-tips=Jumlah halaman dalam seluruh file (Nilai Hitungan)
inuse-pgcnt-text=Jumlah halaman penyimpanan data (Digunakan)
inuse-pgcnt-tips=Jumlah halaman penyimpanan data (Digunakan)
free-pgcnt2-text=Jumlah halaman tidak menyimpan data (Setiap header)
free-pgcnt2-tips=Jumlah halaman tidak menyimpan data (Setiap header)
free-pgcnt-text=Jumlah halaman tidak menyimpan data (Nilai Hitungan)
free-pgcnt-tips=Jumlah halaman tidak menyimpan data (Nilai Hitungan)
av-pgcnt-text=Jumlah halaman yang dihapus otomatis
av-pgcnt-tips=Jumlah halaman yang dihapus otomatis
ntable-text=Jumlah tabel dalam basis data
ntable-tips=Jumlah tabel dalam basis data
nindex-text=Jumlah indeks
nindex-tips=Jumlah indeks
nmanindex-text=Jumlah indeks yang didefinisikan
nmanindex-tips=Jumlah indeks yang didefinisikan
nautoindex-text=Jumlah indeks implisit (Indeks Auto Increment)
nautoindex-tips=Jumlah indeks implisit (Indeks Auto Increment)
user-payload-text=Jumlah byte penyimpanan payload efektif pengguna
user-payload-tips=Jumlah byte penyimpanan payload efektif pengguna
all-tbl-entrycnt-title=Jumlah data semua tabel (Jumlah)
all-tbl-idx-pagecnt-title=Jumlah halaman semua tabel dan indeksnya
sperate-tbl-idx-pagecnt-title=Jumlah halaman semua tabel dan indeks dihitung terpisah
all-tbl-idx-report-title=Semua tabel dan indeks
total-pages-percent-text=Persentase dari total basis data
total-pages-percent-tips=Persentase dari total basis data
nentry-text=Jumlah data (Jumlah)
nentry-tips=Jumlah data (Jumlah)
storage-text=Jumlah byte penyimpanan yang dikonsumsi
storage-tips=Jumlah byte penyimpanan yang dikonsumsi
compressed-size-text=Jumlah byte yang digunakan setelah kompresi
compressed-size-tips=Jumlah byte yang digunakan setelah kompresi
payload-text=Jumlah byte payload
payload-tips=Jumlah byte payload
total-meta-text=Jumlah byte metadata
total-meta-tips=Jumlah byte metadata
depth-text=Kedalaman B-tree
depth-tips=Kedalaman B-tree
avg-payload-text=Payload efektif rata-rata per data
avg-payload-tips=Payload efektif rata-rata per data
avg-unused-text=Jumlah byte tidak digunakan rata-rata per data
avg-unused-tips=Jumlah byte tidak digunakan rata-rata per data
avg-meta-text=Metadata rata-rata per data
avg-meta-tips=Metadata rata-rata per data
avg-fanout-text=Jumlah fanout rata-rata
avg-fanout-tips=Jumlah fanout rata-rata
gap-cnt-text=Halaman tidak kontigu
gap-cnt-tips=Halaman tidak kontigu
mx-payload-text=Payload efektif maksimum per data
mx-payload-tips=Payload efektif maksimum per data
ovfl-cnt-text=Jumlah data overflow yang digunakan
ovfl-cnt-tips=Jumlah data overflow yang digunakan
int-pages-text=Jumlah halaman indeks yang digunakan
int-pages-tips=Jumlah halaman indeks yang digunakan
leaf-pages-text=Jumlah halaman leaf yang digunakan
leaf-pages-tips=Jumlah halaman leaf yang digunakan
ovfl-pages-text=Jumlah halaman overflow yang digunakan
ovfl-pages-tips=Jumlah halaman overflow yang digunakan
total-pages-text=Jumlah total halaman yang digunakan
total-pages-tips=Jumlah total halaman yang digunakan
int-unused-text=Jumlah byte tidak digunakan pada halaman indeks
int-unused-tips=Jumlah byte tidak digunakan pada halaman indeks
leaf-unused-text=Jumlah byte tidak digunakan pada halaman leaf
leaf-unused-tips=Jumlah byte tidak digunakan pada halaman leaf
ovfl-unused-text=Jumlah byte tidak digunakan pada halaman overflow
ovfl-unused-tips=Jumlah byte tidak digunakan pada halaman overflow
total-unused-text=Jumlah byte tidak digunakan pada semua halaman
total-unused-tips=Jumlah byte tidak digunakan pada semua halaman
all-table-report-title=Semua tabel (Kecuali indeks)
all-indices-report-title=Semua indeks (Kecuali tabel)
tbl-and-all-idx-report-title=Tabel {tblName} dan semua indeksnya
tbl-only-report-title=Tabel {tblName} kecuali indeks apa pun
idx-only-report-title=Semua indeks tabel {tblName}
tbl-report-title=Tabel {tblName}
idx-report-title=Indeks {idxName} dari tabel {tblName}
props-tbl-only-report-title=Analisis penyimpanan tabel {tblName}
props-idx-props-only-report-title=Semua indeks tabel {tblName}
db-pragma-params=Parameter PRAGMA
db-quick-config-params=Skema konfigurasi cepat
select-pragma=PRAGMA
pragma-analysis-limit-tips=Kueri atau ubah batas pengaturan analisis aproksimasi (ANALYZE). Ini adalah jumlah baris aproksimasi yang diperiksa perintah analisis (ANALYZE) di setiap indeks.
pragma-application-id-tips=Digunakan untuk mengkueri atau mengatur integer "Applicatioin ID" 32-bit signed big-endian pada offset 68 ke header basis data.
pragma-auto-vacuum-tips=Mengkueri atau mengatur status vacuum otomatis dalam basis data.
pragma-automatic-index-tips=Mengkueri, mengatur, atau menghapus fungsi indeks otomatis.
pragma-busy-timeout-tips=Mengkueri atau mengubah pengaturan timeout sibuk (busy timeout).
pragma-cache-size-tips=Mengkueri atau mengubah jumlah halaman disk basis data maksimum yang direkomendasikan SQLite untuk dipertahankan dalam memori untuk setiap file basis data yang dibuka.
pragma-cache-spill-tips=Aktifkan atau nonaktifkan fungsi pager untuk menumpahkan halaman cache kotor ke file basis data di tengah transaksi.
pragma-case-sensitive-like-tips=Perilaku default operator LIKE adalah mengabaikan huruf besar/kecil karakter ASCII. Oleh karena itu, secara default, 'a' LIKE 'A' adalah true.
pragma-cell-size-check-tips=Aktifkan atau nonaktifkan pemeriksaan integritas lainnya saat membaca halaman B-tree basis data dari disk untuk pertama kalinya. Setelah mengaktifkan pemeriksaan ukuran sel, kerusakan basis data dapat dideteksi lebih awal dan kemungkinan "menyebar (Spread)" lebih kecil.
pragma-checkpoint-fullfsync-tips=Mengkueri atau mengubah flag fullfsync operasi checkpoint. Jika flag ini diatur, metode sinkronisasi F_FULLFSYNC akan digunakan selama pelaksanaan operasi checkpoint pada sistem yang mendukung F_FULLFSYNC. Nilai default flag CHECKPOINT_FULLFSYNC adalah OFF. Hanya Mac OS-X yang mendukung F_FULLFSYNC.
pragma-collation-list-tips=Mengembalikan daftar urutan kolasi yang didefinisikan untuk koneksi basis data saat ini.
pragma-compile-options-tips=Mengembalikan nama opsi waktu kompilasi yang digunakan saat membangun SQLite, satu opsi per baris.
pragma-count-changes-tips=Mengkueri atau mengubah flag count-changes. Biasanya, ketika flag count-changes tidak diatur, pernyataan INSERT, UPDATE, dan DELETE tidak mengembalikan data.
pragma-data-store-directory-tips=Mengkueri atau mengubah nilai variabel global sqlite3_data_directory, backend antarmuka sistem operasi Windows menggunakan variabel ini untuk menentukan lokasi penyimpanan file basis data yang ditentukan dengan nama jalur relatif.
pragma-data-version-tips=Menunjukkan file basis data telah dimodifikasi. Program interaktif yang menyimpan konten basis data dalam memori atau menampilkan konten basis data di layar dapat menggunakan perintah PRADMA data_version untuk menentukan apakah mereka perlu menyegarkan dan memuat ulang memori atau memperbarui tampilan layar.
pragma-default-cache-size-tips=Mengkueri atau mengatur jumlah halaman cache disk maksimum yang direkomendasikan yang akan dialokasikan untuk setiap file basis data yang dibuka.
pragma-defer-foreign-keys-tips=Menunjukkan semua kendala kunci asing ditunda hingga commit transaksi terluar.
pragma-empty-result-callbacks-tips=Mengkueri atau mengubah flag callback hasil kosong.
pragma-encoding-tips=Enkoding teks yang digunakan oleh basis data utama, salah satu dari 'UTF-8', 'UTF-16le'(Enkoding UTF-16 little-endian) atau'UTF-16be'(Enkoding UTF-16 big-endian).
pragma-foreign-key-check-tips=Periksa apakah basis data atau tabel memiliki pelanggaran kendala kunci asing
pragma-foreign-keys-tips=Mengkueri, mengatur, atau menghapus penerapan kendala kunci asing.
pragma-freelist-count-tips=Mengembalikan jumlah halaman yang tidak digunakan dalam file basis data.
pragma-full-column-names-tips=Mengkueri atau mengubah flag full_column_names.
pragma-fullfsync-tips=Mengkueri atau mengubah flag fullfsync. Flag ini menentukan apakah metode tersebut digunakan pada sistem yang mendukung metode sinkronisasi F_FULLFSYNC. Nilai default flag Fullfsync adalah OFF. Hanya Mac OS X yang mendukung F_FULLFSYNC.
pragma-hard-heap-limit-tips=Memberlakukan batas pada jumlah memori heap untuk semua koneksi basis data dalam satu proses.
pragma-ignore-check-constraints-tips=Aktifkan atau nonaktifkan penerapan kendala check. Pengaturan default adalah OFF, yang berarti kendala check diberlakukan secara default.
pragma-incremental-vacuum-tips=Menyebabkan maksimal N halaman dihapus dari free list.
pragma-integrity-check-tips=Melakukan pemeriksaan format dan konsistensi tingkat rendah pada basis data.
pragma-journal-mode-tips=Mengkueri atau mengatur mode jurnal basis data yang terkait dengan koneksi basis data saat ini.
pragma-journal-size-limit-tips=Membatasi ukuran log rollback dan file WAL yang tersisa di sistem file setelah transaksi atau checkpoint.
pragma-legacy-alter-table-tips=Mengatur atau mengkueri nilai flag legacy_alter_table.
pragma-locking-mode-tips=Mengatur atau mengkueri mode locking koneksi basis data. Mode locking adalah mode normal (NORMAL) atau mode eksklusif (EXCLUSIVE).
pragma-max-page-count-tips=Mengkueri atau mengatur jumlah halaman maksimum dalam file basis data.
pragma-mmap-size-tips=Mengkueri atau mengubah jumlah byte maksimum yang dicadangkan untuk I/O memory-mapped (memory-mapped I/O) pada satu basis data.
pragma-module-list-tips=Mengembalikan daftar modul tabel virtual yang terdaftar dengan koneksi basis data.
pragma-optimize-tips=Mencoba mengoptimalkan basis data.
pragma-page-count-tips=Mengembalikan jumlah total halaman dalam file basis data.
pragma-page-size-tips=Mengkueri atau mengatur ukuran halaman basis data. Ukuran halaman harus berupa pangkat 2 antara 512% dan 65536.
pragma-parser-trace-tips=Aktifkan pelacakan parser SQL yang digunakan secara internal oleh SQLite. Berfungsi saat dikompilasi dengan SQLITE_DEBUG.
pragma-query-only-tips=Mencegah perubahan data pada file basis data. Ketika ini diaktifkan, setiap upaya CREATE, REPORT, DROP, REPORT, atau UPDATE akan menyebabkan kesalahan SQLITE_READONLY.
pragma-quick-check-tips=Melakukan pengaturan format dan pemeriksaan konsistensi tingkat rendah pada basis data, melewatkan pemeriksaan konsistensi UNIQUE dan indeks.
pragma-read-uncommitted-tips=Mengkueri, mengatur, atau menghapus isolasi READ UNCOMMITTED.
pragma-recursive-triggers-tips=Mengkueri, mengatur, atau menghapus fungsi rekursif trigger.
pragma-reverse-unordered-selects-tips=Ketika diaktifkan, PRAGMA ini menyebabkan banyak pernyataan SELECT tanpa klausa ORDER BY mengeluarkan hasil dalam urutan yang berlawanan dengan biasanya.
pragma-schema-version-tips=Mendapatkan atau mengatur nilai integer chema-versio pada offset 40 di header basis data.
pragma-secure-delete-tips=Mengkueri atau mengubah pengaturan hapus aman (secure-delete).
pragma-short-column-names-tips=Mengkueri atau mengubah flag nama kolom pendek.
pragma-soft-heap-limit-tips=Membatasi jumlah memori heap yang ditempati untuk semua koneksi basis data dalam satu proses.
pragma-stats-tips=Mengembalikan informasi tambahan tentang tabel dan indeks.
pragma-synchronous-tips=Mengkueri atau mengubah pengaturan flag "sinkron (synchronous)".
pragma-temp-store-tips=Mengkueri atau mengubah nilai variabel global sqlite3_temp_directory, banyak backend antarmuka sistem operasi menggunakan variabel ini untuk menentukan di mana menyimpan tabel dan indeks sementara.
pragma-threads-tips=Jumlah thread bantuan yang dimulai oleh pernyataan yang disiapkan (prepared statement) untuk membantu kueri.
pragma-trusted-schema-tips=Apakah mengizinkan menjalankan fungsi SQL dan tabel virtual yang belum diaudit keamanan dalam schema. Menentukan apakah mengizinkan tampilan, trigger, atau ekspresi schema (seperti kendala CHECK, klausa DEFAULT, kolom yang dihasilkan, indeks ekspresi, dan/atau indeks parsial) untuk menjalankan fungsi SQL dan tabel virtual yang belum diaudit keamanan.
pragma-user-version-tips=Mendapatkan atau mengatur nilai integer user-version pada offset 60 di header basis data
pragma-vdbe-addoptrace-tips=Kode operasi VDBE lengkap ditampilkan saat dibuat selama pembuatan kode. Prasyaratnya adalah SQLite dikompilasi dengan opsi SQLITE_DEBUG dan vdbe_debug diaktifkan.
pragma-vdbe-debug-tips=Aktifkan debug VDBE, prasyaratnya adalah SQLite dikompilasi dengan opsi SQLITE_DEBUG
pragma-vdbe-listing-tips=Tampilkan daftar kode operasi mesin virtual lengkap pada output standar. Prasyaratnya adalah SQLite dikompilasi dengan opsi SQLITE_DEBUG dan vdbe_debug diaktifkan.
pragma-vdbe-trace-tips=Cetak kode operasi mesin virtual pada output standar saat menghitung. Prasyaratnya adalah SQLite dikompilasi dengan opsi SQLITE_DEBUG dan vdbe_debug diaktifkan.
pragma-wal-autocheckpoint-tips=Mengkueri atau mengatur interval write-ahead log/auto-checkpoint.
pragma-wal-checkpoint-tips=Menyebabkan konten dalam write-ahead log basis data X pada koneksi basis data D ditransfer ke file basis data, dan mengatur ulang write-ahead log.
pragma-writable-schema-tips=Tabel sqlite_schema dapat diubah menggunakan pernyataan UPDATE, INSERT, dan DELETE biasa. Peringatan: Menyalahgunakan instruksi kompilasi ini dapat dengan mudah menyebabkan kerusakan file basis data.
pragma-save-confirm=Pernyataan PRAGMA akan mempengaruhi operasi basis data, yakin ingin menjalankan pernyataan di bawah ini?
confirm-exec-text=Konfirmasi &Jalankan